  //เพิ่มสไตล์เสียง
  Set<String> selectedStyles = {};
  String selectedVoiceStyle = ''; // ตัวแปรเก็บเสียงที่ผู้ใช้เลือก
  String selectedStyle = ''; // สไตล์เสียงที่เลือก

  // ข้อมูลตัวเลือกต่าง ๆ สำหรับภาษาไทยและภาษาอังกฤษ
  // สไตล์เสียงภาษาไทย
  List<String> voiceStyle = [
    'เสียงขี้เล่น',
    'เสียงจริงจัง',
    'เสียงชัดเจน',
    'เสียงตื่นเต้น',
    'เสียงทุ้ม',
    'เสียงท้องถิ่น',
    'เสียงนิ่มนวล',
    'เสียงนุ่มนวล',
    'เสียงน่ารัก',
    'เสียงน่าเชื่อถือ',
    'เสียงมั่นใจ',
    'เสียงหวาน',
    'เสียงอบอุ่น',
    'เสียงอีสาน',
    'เสียงเหนือ',
    'เสียงใจเย็น',
    'ใต้'
  ];